fishr/Origin/STM32 pin mapping.ioc
#MicroXplorer Configuration settings - do not modify
#Sun Nov 16 22:43:38 EST 2014
ADC3.AutoInjectedConv-ADC_Injected_ConversionMode=DISABLE
ADC3.Channel-12\#ChannelRegularConversion=ADC_CHANNEL_4
ADC3.Channel-IN4=ADC_CHANNEL_4
ADC3.IPParameters=Mode-ADCs_Common_Settings,InjectedDiscontinuousConvMode-ADC_Injected_ConversionMode,AutoInjectedConv-ADC_Injected_ConversionMode,Channel-12\#ChannelRegularConversion,Channel-IN4,SamplingTime-12\#ChannelRegularConversion,Rank-12\#ChannelRegularConversion,NbrOfConversionFlag
ADC3.InjectedDiscontinuousConvMode-ADC_Injected_ConversionMode=DISABLE
ADC3.Mode-ADCs_Common_Settings=__NULL
ADC3.NbrOfConversionFlag=1
ADC3.Rank-12\#ChannelRegularConversion=1
ADC3.SamplingTime-12\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
FMC.IPParameters=SDRAM_Instance-SdramChipSelect2_1,InternalBankNumber1-SdramChipSelect2_1,RPDelay2,RowCycleDelay2,SDCoherentPinout1-SdramChipSelect2_1,SDBank1-SdramChipSelect2_1,SDMemoryDataWidth1-SdramChipSelect2_1
FMC.InternalBankNumber1-SdramChipSelect2_1=FMC_SDRAM_INTERN_BANKS_NUM_4
FMC.RPDelay2=2
FMC.RowCycleDelay2=7
FMC.SDBank1-SdramChipSelect2_1=FMC_SDRAM_BANK2
FMC.SDCoherentPinout1-SdramChipSelect2_1=MEMORY_PINOUT_OK
FMC.SDMemoryDataWidth1-SdramChipSelect2_1=FMC_SDRAM_MEM_BUS_WIDTH_16
FMC.SDRAM_Instance-SdramChipSelect2_1=FMC_SDRAM_DEVICE
File.Version=4
I2C3.DutyCycle=I2C_DUTYCYCLE_16_9
I2C3.IPParameters=DutyCycle
KeepUserPlacement=false
LTDC.AccumulatedActiveH-RGB666=323
LTDC.AccumulatedActiveW-RGB666=269
LTDC.AccumulatedHBP-RGB666=29
LTDC.AccumulatedVBP-RGB666=3
LTDC.ActiveH-RGB666=320
LTDC.ActiveW-RGB666=240
LTDC.Blue-RGB666=0
LTDC.DEPolarity-RGB666=LTDC_DEPOLARITY_AH
LTDC.HBP-RGB666=20
LTDC.HFP-RGB666=10
LTDC.HSync-RGB666=10
LTDC.HorizontalSync-RGB666=9
LTDC.IPParameters=AccumulatedActiveH-RGB666,TotalHeigh-RGB666,VFP-RGB666,VerticalSync-RGB666,VSync-RGB666,HSync-RGB666,DEPolarity-RGB666,TotalWidth-RGB666,ActiveH-RGB666,HFP-RGB666,ActiveW-RGB666,HBP-RGB666,Blue-RGB666,AccumulatedActiveW-RGB666,AccumulatedHBP-RGB666,AccumulatedVBP-RGB666,HorizontalSync-RGB666
LTDC.TotalHeigh-RGB666=327
LTDC.TotalWidth-RGB666=279
LTDC.VFP-RGB666=4
LTDC.VSync-RGB666=2
LTDC.VerticalSync-RGB666=1
Mcu.Family=STM32F4
Mcu.IP0=ADC3
Mcu.IP1=FMC
Mcu.IP10=UART5
Mcu.IP11=USB_OTG_HS
Mcu.IP2=I2C3
Mcu.IP3=LTDC
Mcu.IP4=NVIC
Mcu.IP5=RCC
Mcu.IP6=SPI1
Mcu.IP7=SPI5
Mcu.IP8=SYS
Mcu.IP9=UART4
Mcu.IPNb=12
Mcu.Name=STM32F429Z(E-G-I)Tx
Mcu.Package=LQFP144
Mcu.Pin0=PE2
Mcu.Pin1=PE3
Mcu.Pin10=PF3
Mcu.Pin100=PE0
Mcu.Pin101=PE1
Mcu.Pin11=PF4
Mcu.Pin12=PF5
Mcu.Pin13=PF6
Mcu.Pin14=PF7
Mcu.Pin15=PF8
Mcu.Pin16=PF9
Mcu.Pin17=PF10
Mcu.Pin18=PH0/OSC_IN
Mcu.Pin19=PH1/OSC_OUT
Mcu.Pin2=PE4
Mcu.Pin20=PC0
Mcu.Pin21=PC1
Mcu.Pin22=PC2
Mcu.Pin23=PC3
Mcu.Pin24=PA0/WKUP
Mcu.Pin25=PA1
Mcu.Pin26=PA2
Mcu.Pin27=PA3
Mcu.Pin28=PA4
Mcu.Pin29=PA5
Mcu.Pin3=PE5
Mcu.Pin30=PA6
Mcu.Pin31=PA7
Mcu.Pin32=PC4
Mcu.Pin33=PB0
Mcu.Pin34=PB1
Mcu.Pin35=PF11
Mcu.Pin36=PF12
Mcu.Pin37=PF13
Mcu.Pin38=PF14
Mcu.Pin39=PF15
Mcu.Pin4=PE6
Mcu.Pin40=PG0
Mcu.Pin41=PG1
Mcu.Pin42=PE7
Mcu.Pin43=PE8
Mcu.Pin44=PE9
Mcu.Pin45=PE10
Mcu.Pin46=PE11
Mcu.Pin47=PE12
Mcu.Pin48=PE13
Mcu.Pin49=PE14
Mcu.Pin5=PC14/OSC32_IN
Mcu.Pin50=PE15
Mcu.Pin51=PB10
Mcu.Pin52=PB11
Mcu.Pin53=PB12
Mcu.Pin54=PB13
Mcu.Pin55=PB14
Mcu.Pin56=PB15
Mcu.Pin57=PD8
Mcu.Pin58=PD9
Mcu.Pin59=PD10
Mcu.Pin6=PC15/OSC32_OUT
Mcu.Pin60=PD11
Mcu.Pin61=PD12
Mcu.Pin62=PD13
Mcu.Pin63=PD14
Mcu.Pin64=PD15
Mcu.Pin65=PG2
Mcu.Pin66=PG3
Mcu.Pin67=PG4
Mcu.Pin68=PG5
Mcu.Pin69=PG6
Mcu.Pin7=PF0
Mcu.Pin70=PG7
Mcu.Pin71=PG8
Mcu.Pin72=PC6
Mcu.Pin73=PC7
Mcu.Pin74=PC8
Mcu.Pin75=PC9
Mcu.Pin76=PA8
Mcu.Pin77=PA10
Mcu.Pin78=PA11
Mcu.Pin79=PA12
Mcu.Pin8=PF1
Mcu.Pin80=PA13
Mcu.Pin81=PA14
Mcu.Pin82=PC10
Mcu.Pin83=PC11
Mcu.Pin84=PC12
Mcu.Pin85=PD0
Mcu.Pin86=PD1
Mcu.Pin87=PD2
Mcu.Pin88=PD3
Mcu.Pin89=PD6
Mcu.Pin9=PF2
Mcu.Pin90=PG10
Mcu.Pin91=PG11
Mcu.Pin92=PG12
Mcu.Pin93=PG15
Mcu.Pin94=PB3
Mcu.Pin95=PB4
Mcu.Pin96=PB5
Mcu.Pin97=PB6
Mcu.Pin98=PB8
Mcu.Pin99=PB9
Mcu.PinsNb=102
Mcu.UserName=STM32F429ZITx
NVIC.OTG_HS_WKUP_IRQn=true\:0\:0
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SysTick_IRQn=true\:0\:0
PA0/WKUP.GPIOParameters=GPIO_Label,GPIO_Speed,GPIO_PuPd,GPIO_Mode
PA0/WKUP.GPIO_Label=GPS_TX
PA0/WKUP.GPIO_Mode=GPIO_MODE_AF_PP
PA0/WKUP.GPIO_PuPd=GPIO_PULLUP
PA0/WKUP.GPIO_Speed=GPIO_SPEED_LOW
PA0/WKUP.Mode=Asynchronous
PA0/WKUP.Signal=UART4_TX
PA1.GPIOParameters=GPIO_Label,GPIO_Speed,GPIO_PuPd,GPIO_Mode
PA1.GPIO_Label=GPS_RX
PA1.GPIO_Mode=GPIO_MODE_AF_PP
PA1.GPIO_PuPd=GPIO_PULLUP
PA1.GPIO_Speed=GPIO_SPEED_LOW
PA1.Mode=Asynchronous
PA1.Signal=UART4_RX
PA10.Locked=true
PA10.Signal=GPIO_Output
PA11.Mode=RGB666
PA11.Signal=LTDC_R4
PA12.Mode=RGB666
PA12.Signal=LTDC_R5
PA13.Locked=true
PA13.Mode=Trace-Asynchronous_SW
PA13.Signal=SYS_JTMS-SWDIO
PA14.Locked=true
PA14.Mode=Trace-Asynchronous_SW
PA14.Signal=SYS_JTCK-SWCLK
PA2.Locked=true
PA2.Signal=GPIO_Output
PA3.Mode=RGB666
PA3.Signal=LTDC_B5
PA4.Mode=RGB666
PA4.Signal=LTDC_VSYNC
PA5.Locked=true
PA5.Mode=Full_Duplex_Master
PA5.Signal=SPI1_SCK
PA6.Mode=RGB666
PA6.Signal=LTDC_G2
PA7.Mode=Full_Duplex_Master
PA7.Signal=SPI1_MOSI
PA8.Mode=I2C
PA8.Signal=I2C3_SCL
PB0.Mode=RGB666
PB0.Signal=LTDC_R3
PB1.Locked=true
PB1.Mode=RGB666
PB1.Signal=LTDC_R6
PB10.Mode=RGB666
PB10.Signal=LTDC_G4
PB11.Mode=RGB666
PB11.Signal=LTDC_G5
PB12.Locked=true
PB12.Signal=GPIO_Input
PB13.Locked=true
PB13.Signal=GPIO_Input
PB14.Mode=Device_Only_FS
PB14.Signal=USB_OTG_HS_DM
PB15.Mode=Device_Only_FS
PB15.Signal=USB_OTG_HS_DP
PB3.Locked=true
PB3.Mode=Trace-Asynchronous_SW
PB3.Signal=SYS_JTDO-SWO
PB4.Mode=Full_Duplex_Master
PB4.Signal=SPI1_MISO
PB5.Mode=SdramChipSelect2_1
PB5.Signal=FMC_SDCKE1
PB6.Mode=SdramChipSelect2_1
PB6.Signal=FMC_SDNE1
PB8.Mode=RGB666
PB8.Signal=LTDC_B6
PB9.Mode=RGB666
PB9.Signal=LTDC_B7
PC0.Signal=FMC_SDNWE
PC1.Locked=true
PC1.Signal=GPIO_Output
PC10.Mode=RGB666
PC10.Signal=LTDC_R2
PC11.Locked=true
PC11.Signal=GPIO_Output
PC12.GPIOParameters=GPIO_Label,GPIO_Speed,GPIO_PuPd,GPIO_Mode
PC12.GPIO_Label=XBEE_TX
PC12.GPIO_Mode=GPIO_MODE_AF_PP
PC12.GPIO_PuPd=GPIO_PULLUP
PC12.GPIO_Speed=GPIO_SPEED_LOW
PC12.Mode=Asynchronous
PC12.Signal=UART5_TX
PC14/OSC32_IN.Mode=LSE-External-Oscillator
PC14/OSC32_IN.Signal=RCC_OSC32_IN
PC15/OSC32_OUT.Mode=LSE-External-Oscillator
PC15/OSC32_OUT.Signal=RCC_OSC32_OUT
PC2.GPIOParameters=GPIO_ModeDefaultOutputPP,GPIO_Label,GPIO_Speed,GPIO_PuPd
PC2.GPIO_Label=LCD_CSX
PC2.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PC2.GPIO_PuPd=GPIO_NOPULL
PC2.GPIO_Speed=GPIO_SPEED_LOW
PC2.Locked=true
PC2.Signal=GPIO_Output
PC3.Locked=true
PC3.Signal=GPIO_Output
PC4.Locked=true
PC4.Signal=GPIO_Output
PC6.Mode=RGB666
PC6.Signal=LTDC_HSYNC
PC7.Mode=RGB666
PC7.Signal=LTDC_G6
PC8.Locked=true
PC8.Signal=GPIO_Output
PC9.Mode=I2C
PC9.Signal=I2C3_SDA
PCC.Family=STM32F4
PCC.MCU=STM32F429Z(E-G-I)Tx
PCC.MXVersion=4.4.0
PCC.PartNumber=STM32F429ZITx
PCC.Seq0=0
PCC.SubFamily=STM32F429/439
PCC.Temperature=25
PCC.Vdd=3.3
PD0.Signal=FMC_D2_DA2
PD1.Signal=FMC_D3_DA3
PD10.Signal=FMC_D15_DA15
PD11.Locked=true
PD11.Signal=GPIO_Output
PD12.Locked=true
PD12.Signal=GPIO_Output
PD13.GPIOParameters=GPIO_ModeDefaultOutputPP,GPIO_Label,GPIO_Speed,GPIO_PuPd
PD13.GPIO_Label=LCD_WRX
PD13.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PD13.GPIO_PuPd=GPIO_NOPULL
PD13.GPIO_Speed=GPIO_SPEED_LOW
PD13.Locked=true
PD13.Signal=GPIO_Output
PD14.Signal=FMC_D0_DA0
PD15.Signal=FMC_D1_DA1
PD2.GPIOParameters=GPIO_Label,GPIO_Speed,GPIO_PuPd,GPIO_Mode
PD2.GPIO_Label=XBEE_RX
PD2.GPIO_Mode=GPIO_MODE_AF_PP
PD2.GPIO_PuPd=GPIO_PULLUP
PD2.GPIO_Speed=GPIO_SPEED_LOW
PD2.Mode=Asynchronous
PD2.Signal=UART5_RX
PD3.Mode=RGB666
PD3.Signal=LTDC_G7
PD6.Mode=RGB666
PD6.Signal=LTDC_B2
PD8.Signal=FMC_D13_DA13
PD9.Signal=FMC_D14_DA14
PE0.Locked=true
PE0.Signal=FMC_NBL0
PE1.Locked=true
PE1.Signal=FMC_NBL1
PE10.Signal=FMC_D7_DA7
PE11.Signal=FMC_D8_DA8
PE12.Signal=FMC_D9_DA9
PE13.Signal=FMC_D10_DA10
PE14.Signal=FMC_D11_DA11
PE15.Signal=FMC_D12_DA12
PE2.Locked=true
PE2.Signal=GPIO_Output
PE3.Locked=true
PE3.Signal=GPIO_Output
PE4.Locked=true
PE4.Signal=GPIO_Input
PE5.Locked=true
PE5.Signal=GPIO_Input
PE6.Locked=true
PE6.Signal=GPIO_Output
PE7.Signal=FMC_D4_DA4
PE8.Signal=FMC_D5_DA5
PE9.Signal=FMC_D6_DA6
PF0.Signal=FMC_A0
PF1.Signal=FMC_A1
PF10.Mode=RGB666
PF10.Signal=LTDC_DE
PF11.Signal=FMC_SDNRAS
PF12.Signal=FMC_A6
PF13.Signal=FMC_A7
PF14.Signal=FMC_A8
PF15.Signal=FMC_A9
PF2.Signal=FMC_A2
PF3.Signal=FMC_A3
PF4.Signal=FMC_A4
PF5.Signal=FMC_A5
PF6.GPIOParameters=GPIO_Label,GPIO_PuPd,GPIO_Mode
PF6.GPIO_Label=BATT_SENSE
PF6.GPIO_Mode=GPIO_MODE_ANALOG
PF6.GPIO_PuPd=GPIO_NOPULL
PF6.Mode=IN4
PF6.Signal=ADC3_IN4
PF7.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Mode
PF7.GPIO_Mode=GPIO_MODE_AF_PP
PF7.GPIO_PuPd=GPIO_PULLDOWN
PF7.GPIO_Speed=GPIO_SPEED_MEDIUM
PF7.Mode=TX_Only_Simplex_Unidirect_Master
PF7.Signal=SPI5_SCK
PF8.Locked=true
PF8.Signal=GPIO_Output
PF9.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Mode
PF9.GPIO_Mode=GPIO_MODE_AF_PP
PF9.GPIO_PuPd=GPIO_PULLDOWN
PF9.GPIO_Speed=GPIO_SPEED_MEDIUM
PF9.Mode=TX_Only_Simplex_Unidirect_Master
PF9.Signal=SPI5_MOSI
PG0.Signal=FMC_A10
PG1.Signal=FMC_A11
PG10.Mode=RGB666
PG10.Signal=LTDC_G3
PG11.Mode=RGB666
PG11.Signal=LTDC_B3
PG12.Mode=RGB666
PG12.Signal=LTDC_B4
PG15.Signal=FMC_SDNCAS
PG2.Locked=true
PG2.Signal=GPIO_Output
PG3.Locked=true
PG3.Signal=GPIO_Output
PG4.Signal=FMC_A14_BA0
PG5.Signal=FMC_A15_BA1
PG6.Mode=RGB666
PG6.Signal=LTDC_R7
PG7.Mode=RGB666
PG7.Signal=LTDC_CLK
PG8.Signal=FMC_SDCLK
PH0/OSC_IN.Mode=HSE-External-Clock-Source
PH0/OSC_IN.Signal=RCC_OSC_IN
PH1/OSC_OUT.Mode=HSE-External-Clock-Source
PH1/OSC_OUT.Signal=RCC_OSC_OUT
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=2
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32F429ZITx
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.3.0
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=0
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=STM32 pin mapping.ioc
ProjectManager.ProjectName=STM32 pin mapping
ProjectManager.TargetToolchain=EWARM 6.70
RCC.48MHZClocksFreq_Value=48000000
RCC.AHBFreq_Value=144000000
RCC.APB1CLKDivider=RCC_HCLK_DIV4
RCC.APB1Freq_Value=36000000
RCC.APB1TimFreq_Value=72000000
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.APB2Freq_Value=72000000
RCC.APB2TimFreq_Value=144000000
RCC.ClockTypePCLK1-ClockTree=RCC_CLOCKTYPE_PCLK1
RCC.ClockTypePCLK2-ClockTree=RCC_CLOCKTYPE_PCLK2
RCC.ClockTypeSysClk-ClockTree=RCC_CLOCKTYPE_SYSCLK
RCC.CortexFreq_Value=18000000
RCC.EnableExtClockForI2S-ClockTree=false
RCC.EnableExtClockForSAIA-ClockTree=false
RCC.EnableExtClockForSAIB-ClockTree=false
RCC.EnableHSE-ClockTree=true
RCC.EnableHSERTCDevisor-ClockTree=false
RCC.EnableLSE-ClockTree=true
RCC.EnableLSERTC-ClockTree=false
RCC.EthernetFreq_Value=144000000
RCC.ExtClockEnable-ClockTree=false
RCC.FCLKCortexFreq_Value=0
RCC.FLatency-AdvancedSettings=FLASH_LATENCY_4
RCC.FamilyName=M
RCC.HCLKFreq_Value=144000000
RCC.HSEState-ClockTree=RCC_HSE_BYPASS
RCC.HSE_VALUE=8000000
RCC.HSIState-ClockTree=RCC_HSI_OFF
RCC.HSI_VALUE=16000000
RCC.I2SClocksFreq_Value=128000000
RCC.I2SEnable-ClockTree=false
RCC.IPParameters=HCLKFreq_Value,RTCEnable-ClockTree,MCO1OutPutEnable-ClockTree,OscillatorTypeHSE-ClockTree,SYSCLKFreq_VALUE,EnableLSE-ClockTree,I2SClocksFreq_Value,SAIBEnable-ClockTree,FamilyName,PLLCLKFreq_Value,RTCHSEDivFreq_Value,APB2CLKDivider,RNGEnable-ClockTree,USBFSEnable-ClockTree,RTCFreq_Value,LSE_VALUE,SAI_AClocksFreq_Value,I2SEnable-ClockTree,SYSCLKSource,IWDGEnable-ClockTree,MCO2PinFreq_Value,CortexFreq_Value,FCLKCortexFreq_Value,APB1CLKDivider,USBHSEnable-ClockTree,ClockTypePCLK1-ClockTree,PLLSourceVirtual,VCOSAIOutputFreq_ValueR,APB2Freq_Value,PLLSAIR,VCOI2SOutputFreq_Value,SAI_BClocksFreq_Value,EnableExtClockForI2S-ClockTree,PLLN,FLatency-AdvancedSettings,EnableExtClockForSAIB-ClockTree,VcooutputI2SQ,ClockTypeSysClk-ClockTree,EnableExtClockForSAIA-ClockTree,APB2TimFreq_Value,MCO2OutPutEnable-ClockTree,HSE_VALUE,VCOSAIOutputFreq_ValueQ,EnableLSERTC-ClockTree,ClockTypePCLK2-ClockTree,RCC_PERIPHCLK_LTDCVar-ClockTree,PWR_Regulator_Voltage_Scale-AdvancedSettings,PLLM,LTDCEnable-ClockTree,HSI_VALUE,LCDTFTFreq_Value,PLLQ,HSIState-ClockTree,PLLSAIDivR,LSIState-ClockTree,PLLState-ClockTree,VcooutputI2S,APB1Freq_Value,APB1TimFreq_Value,PLLSAIN,48MHZClocksFreq_Value,ExtClockEnable-ClockTree,HSEState-ClockTree,SDIOEnable-ClockTree,AHBFreq_Value,LSI_VALUE,VCOInputFreq_Value,EnableHSE-ClockTree,EthernetFreq_Value,VCOOutputFreq_Value,SAIAEnable-ClockTree,LSEState-ClockTree,OscillatorTypeLSI-ClockTree,EnableHSERTCDevisor-ClockTree,VCOSAIOutputFreq_Value,PLLI2SCLKSAIA_BEnable-ClockTree
RCC.IWDGEnable-ClockTree=false
RCC.LCDTFTFreq_Value=4166666.6666666665
RCC.LSEState-ClockTree=RCC_LSE_ON
RCC.LSE_VALUE=32768
RCC.LSIState-ClockTree=RCC_LSI_OFF
RCC.LSI_VALUE=32000
RCC.LTDCEnable-ClockTree=true
RCC.MCO1OutPutEnable-ClockTree=false
RCC.MCO2OutPutEnable-ClockTree=false
RCC.MCO2PinFreq_Value=144000000
RCC.OscillatorTypeHSE-ClockTree=RCC_OSCILLATORTYPE_HSE
RCC.OscillatorTypeLSI-ClockTree=
RCC.PLLCLKFreq_Value=144000000
RCC.PLLI2SCLKSAIA_BEnable-ClockTree=false
RCC.PLLM=6
RCC.PLLN=216
RCC.PLLQ=6
RCC.PLLSAIDivR=RCC_PLLSAIDIVR_16
RCC.PLLSAIN=200
RCC.PLLSAIR=4
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
RCC.PLLState-ClockTree=RCC_PLL_ON
RCC.PWR_Regulator_Voltage_Scale-AdvancedSettings=PWR_REGULATOR_VOLTAGE_SCALE1
RCC.RCC_PERIPHCLK_LTDCVar-ClockTree=RCC_PERIPHCLK_LTDC
RCC.RNGEnable-ClockTree=false
RCC.RTCEnable-ClockTree=false
RCC.RTCFreq_Value=32000
RCC.RTCHSEDivFreq_Value=4000000
RCC.SAIAEnable-ClockTree=false
RCC.SAIBEnable-ClockTree=false
RCC.SAI_AClocksFreq_Value=66666666.666666664
RCC.SAI_BClocksFreq_Value=66666666.666666664
RCC.SDIOEnable-ClockTree=false
RCC.SYSCLKFreq_VALUE=144000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.USBFSEnable-ClockTree=false
RCC.USBHSEnable-ClockTree=true
RCC.VCOI2SOutputFreq_Value=256000000
RCC.VCOInputFreq_Value=1333333.3333333333
RCC.VCOOutputFreq_Value=288000000
RCC.VCOSAIOutputFreq_Value=266666666.66666666
RCC.VCOSAIOutputFreq_ValueQ=66666666.666666664
RCC.VCOSAIOutputFreq_ValueR=66666666.666666664
RCC.VcooutputI2S=128000000
RCC.VcooutputI2SQ=128000000
SH.FMC_A0.0=FMC_A0,12b-sda1
SH.FMC_A0.ConfNb=1
SH.FMC_A1.0=FMC_A1,12b-sda1
SH.FMC_A1.ConfNb=1
SH.FMC_A10.0=FMC_A10,12b-sda1
SH.FMC_A10.ConfNb=1
SH.FMC_A11.0=FMC_A11,12b-sda1
SH.FMC_A11.ConfNb=1
SH.FMC_A14_BA0.0=FMC_BA0,FourSdramBanks1
SH.FMC_A14_BA0.ConfNb=1
SH.FMC_A15_BA1.0=FMC_BA1,FourSdramBanks1
SH.FMC_A15_BA1.ConfNb=1
SH.FMC_A2.0=FMC_A2,12b-sda1
SH.FMC_A2.ConfNb=1
SH.FMC_A3.0=FMC_A3,12b-sda1
SH.FMC_A3.ConfNb=1
SH.FMC_A4.0=FMC_A4,12b-sda1
SH.FMC_A4.ConfNb=1
SH.FMC_A5.0=FMC_A5,12b-sda1
SH.FMC_A5.ConfNb=1
SH.FMC_A6.0=FMC_A6,12b-sda1
SH.FMC_A6.ConfNb=1
SH.FMC_A7.0=FMC_A7,12b-sda1
SH.FMC_A7.ConfNb=1
SH.FMC_A8.0=FMC_A8,12b-sda1
SH.FMC_A8.ConfNb=1
SH.FMC_A9.0=FMC_A9,12b-sda1
SH.FMC_A9.ConfNb=1
SH.FMC_D0_DA0.0=FMC_D0,sd-16b-d1
SH.FMC_D0_DA0.ConfNb=1
SH.FMC_D10_DA10.0=FMC_D10,sd-16b-d1
SH.FMC_D10_DA10.ConfNb=1
SH.FMC_D11_DA11.0=FMC_D11,sd-16b-d1
SH.FMC_D11_DA11.ConfNb=1
SH.FMC_D12_DA12.0=FMC_D12,sd-16b-d1
SH.FMC_D12_DA12.ConfNb=1
SH.FMC_D13_DA13.0=FMC_D13,sd-16b-d1
SH.FMC_D13_DA13.ConfNb=1
SH.FMC_D14_DA14.0=FMC_D14,sd-16b-d1
SH.FMC_D14_DA14.ConfNb=1
SH.FMC_D15_DA15.0=FMC_D15,sd-16b-d1
SH.FMC_D15_DA15.ConfNb=1
SH.FMC_D1_DA1.0=FMC_D1,sd-16b-d1
SH.FMC_D1_DA1.ConfNb=1
SH.FMC_D2_DA2.0=FMC_D2,sd-16b-d1
SH.FMC_D2_DA2.ConfNb=1
SH.FMC_D3_DA3.0=FMC_D3,sd-16b-d1
SH.FMC_D3_DA3.ConfNb=1
SH.FMC_D4_DA4.0=FMC_D4,sd-16b-d1
SH.FMC_D4_DA4.ConfNb=1
SH.FMC_D5_DA5.0=FMC_D5,sd-16b-d1
SH.FMC_D5_DA5.ConfNb=1
SH.FMC_D6_DA6.0=FMC_D6,sd-16b-d1
SH.FMC_D6_DA6.ConfNb=1
SH.FMC_D7_DA7.0=FMC_D7,sd-16b-d1
SH.FMC_D7_DA7.ConfNb=1
SH.FMC_D8_DA8.0=FMC_D8,sd-16b-d1
SH.FMC_D8_DA8.ConfNb=1
SH.FMC_D9_DA9.0=FMC_D9,sd-16b-d1
SH.FMC_D9_DA9.ConfNb=1
SH.FMC_NBL0.0=FMC_NBL0,Sd2ByteEnable1
SH.FMC_NBL0.ConfNb=1
SH.FMC_NBL1.0=FMC_NBL1,Sd2ByteEnable1
SH.FMC_NBL1.ConfNb=1
SH.FMC_SDCLK.0=FMC_SDCLK,12b-sda1
SH.FMC_SDCLK.ConfNb=1
SH.FMC_SDNCAS.0=FMC_SDNCAS,12b-sda1
SH.FMC_SDNCAS.ConfNb=1
SH.FMC_SDNRAS.0=FMC_SDNRAS,12b-sda1
SH.FMC_SDNRAS.ConfNb=1
SH.FMC_SDNWE.0=FMC_SDNWE,12b-sda1
SH.FMC_SDNWE.ConfNb=1
SPI1.BaudRatePrescaler-Full_Duplex_Master=SPI_BAUDRATEPRESCALER_16
SPI1.CalculateBaudRate-Full_Duplex_Master=9.0 MBits/s
SPI1.Direction-Full_Duplex_Master=SPI_DIRECTION_2LINES
SPI1.IPParameters=Direction-Full_Duplex_Master,CalculateBaudRate-Full_Duplex_Master,VirtualType-Full_Duplex_Master,BaudRatePrescaler-Full_Duplex_Master,TIMode-Full_Duplex_Master,Mode-Full_Duplex_Master,NSS-Full_Duplex_Master
SPI1.Mode-Full_Duplex_Master=SPI_MODE_MASTER
SPI1.NSS-Full_Duplex_Master=SPI_NSS_SOFT
SPI1.TIMode-Full_Duplex_Master=SPI_TIMODE_DISABLED
SPI1.VirtualType-Full_Duplex_Master=VM_MASTER
SPI5.BaudRatePrescaler-TX_Only_Simplex_Unidirect_Master=SPI_BAUDRATEPRESCALER_16
SPI5.CRCCalculation-TX_Only_Simplex_Unidirect_Master=SPI_CRCCALCULATION_ENABLED
SPI5.CRCPolynomial-TX_Only_Simplex_Unidirect_Master=X7+X6+X5+X4+X3+X2+X1+X0
SPI5.CalculateBaudRate-TX_Only_Simplex_Unidirect_Master=4.5 MBits/s
SPI5.Direction-TX_Only_Simplex_Unidirect_Master=SPI_DIRECTION_2LINES
SPI5.IPParameters=TIMode-TX_Only_Simplex_Unidirect_Master,CalculateBaudRate-TX_Only_Simplex_Unidirect_Master,BaudRatePrescaler-TX_Only_Simplex_Unidirect_Master,Mode-TX_Only_Simplex_Unidirect_Master,Direction-TX_Only_Simplex_Unidirect_Master,NSS-TX_Only_Simplex_Unidirect_Master,CRCCalculation-TX_Only_Simplex_Unidirect_Master,VirtualType-TX_Only_Simplex_Unidirect_Master,CRCPolynomial-TX_Only_Simplex_Unidirect_Master
SPI5.Mode-TX_Only_Simplex_Unidirect_Master=SPI_MODE_MASTER
SPI5.NSS-TX_Only_Simplex_Unidirect_Master=SPI_NSS_SOFT
SPI5.TIMode-TX_Only_Simplex_Unidirect_Master=SPI_TIMODE_DISABLED
SPI5.VirtualType-TX_Only_Simplex_Unidirect_Master=VM_MASTER
UART4.BaudRate=9600
UART4.IPParameters=Mode-Asynchronous,VirtualMode-Asynchronous,BaudRate,OverSampling-Asynchronous
UART4.Mode-Asynchronous=UART_MODE_TX_RX
UART4.OverSampling-Asynchronous=UART_OVERSAMPLING_16
UART4.VirtualMode-Asynchronous=Asynchronous
UART5.IPParameters=VirtualMode-Asynchronous
UART5.VirtualMode-Asynchronous=Asynchronous
USB_OTG_HS.IPParameters=speed-Device_Only_FS,VirtualMode-Device_Only_FS,use_dedicated_ep1-Device_Only_FS,phy_itface-Device_Only_FS
USB_OTG_HS.VirtualMode-Device_Only_FS=Device_Only_FS
USB_OTG_HS.phy_itface-Device_Only_FS=USB_OTG_EMBEDDED_PHY
USB_OTG_HS.speed-Device_Only_FS=PCD_SPEED_FULL
USB_OTG_HS.use_dedicated_ep1-Device_Only_FS=DISABLE
